In [1]:
import numpy as np
import pandas as pd

In [11]:
# NaN is a short for Not a Number
df = pd.DataFrame(
    [
        [10, 20, 30],
        [np.nan, 50, 60],
        [np.nan, 80, np.nan]
    ],
    index=['A', 'B', 'C'],
    columns=['C1', 'C2', 'C3']
)
df

     C1  C2    C3
A  10.0  20  30.0
B   NaN  50  60.0
C   NaN  80   NaN

In [5]:
# Return a result that doesn't contain any rows with NaN values
df.dropna(axis=0)

     C1  C2    C3
A  10.0  20  30.0

In [6]:
# Actually drops any row contain any NaN values
df.dropna(inplace=True)

In [8]:
# Return a result that doesn't contain any columns with NaN values
df.dropna(axis=1)

   C2
A  20
B  50
C  80

In [9]:
# Actually drops any columns contain any NaN values
df.dropna(axis=1, inplace=True)

In [12]:
# Drop any column that contain 2 or more than NaN values
df.dropna(axis=1, thresh=2)

   C2    C3
A  20  30.0
B  50  60.0
C  80   NaN

In [15]:
# Fill any cell that contain NaN with a specific value
df.fillna("MASK")

     C1  C2    C3
A  10.0  20  30.0
B  MASK  50  60.0
C  MASK  80  MASK

In [17]:
# Fill any cell that contains NaN with the summation of values in a specific cell
df.fillna(df['C2'].sum())

      C1  C2     C3
A   10.0  20   30.0
B  150.0  50   60.0
C  150.0  80  150.0

In [18]:
# Fill any cell that contains NaN with the mean of values in a specific cell
df.fillna(df['C2'].mean())

     C1  C2    C3
A  10.0  20  30.0
B  50.0  50  60.0
C  50.0  80  50.0